#!/usr/bin/env python
# coding: utf-8

# In[5]:


from nltk import word_tokenize


# In[9]:


data ="""تحت عنوان أزياء مشعة قدم المصمم اللبناني بسيل سودة هذا الشهر عرضه في روما،
وهو العرض السابع بعد عدة عروض ناجحة أقامها في بيروت، انتقد سودة هجرة المصممين
العرب ألى الدول الأوروبية لتقديم عروضهم، وطالب بتأسيس أسبوع عربي للموضة
بمواصفات عالمية، يقدم الأبداعات العربية ويعمل على تطوير المهنة، ونفى احتكار
الرجل التصميم للمرأة، مؤكدا أن قدرة المرأة على التصميم للرجل، وآراء أخرى في
هذا الحوار.
 * كيف كان عرضك الأخير في روما وما المجموعة التي قدمتها؟
 ـ قدمت في عرض روما مجموعة من 40 قطعة لموسم الصيف مستوحاة من فترة السبعينيات،
استخدمت فيها الأقمشة التي تستخدم عادة في أزياء الهوت كوتيور مثل الموسلين
والحرير، ولكن بطريقة جديدة مع استخدام الأكسسوار، العرض أقيم تحت عنوان "أزياء
مشعة"، وعلى المستوى العربي كانت الأصداء جيدة جدا.
 * ما هي الألوان والأقمشة التي تفضل استعمالها في تصاميمك؟
 ـ أفضل عادة ألوان الباستيل من الأصفر ألى البيتش سومو والتركواز والبيج والزهر،
وهذه هي ألوان الموضة، وهناك الأسود الذي مازال محافظا على رونقه، والأبيض كذلك،
أما القماش فيحدد حسب موضة العام، فالموضة تحتم عليك نوعية قماش محددة وتضعك في
أطار معين.
 * ما هي المعوقات لمجال تصميم الأزياء في لبنان؟
 ـ المشكلة في عدم وجود أسبوع سنوي للموضة يقام في لبنان على نطاق عالمي، وهجرة
العقول المبدعة، فالمصممون يتركون بلدهم ويعرضون في الخارج، والمفروض أن نقيم
أسبوعا للموضة في العالم العربي بشكل عالمي، فيحدث من خلاله النقد والتطوير، كما
يحدث في روما ولندن ونيويورك اليوم، يجب أن نعمل اليوم قبل الغد على تأسيس هذا
الأسبوع، ولبنان أكثر بلد عنده مقومات أقامة أسبوع موضة، فلديه الأيدي العاملة
والتقنية، مما يمكنه من أقامة أسبوع للموضة، يدرج على المستوى العالمي.
 * لماذا ترتبط الموضة غالبا بارتفاع السعر، وكيف يمكن تحقيق معادلة الأناقة
للجميع؟
 ـ أكيد ان الأناقة حق للجميع، ولكن الهوت كوتيور لا يمكن تقديمه للجميع، تماما
مثل الشخص الذي يشتري منزلا غاليا ويعد له الديكور الخاص به، ولكن عن طريق
الفستان الجاهز والخياطين يمكن أن نقدم تصميمات أنيقة للجميع، ولكن الهوت كوتيور
لا يمكن أن يكون للجميع، لأنها نوعية من الأزياء يتم ارتداؤها في مناسبات معينة
خاصة جدا، مثل الأفراح والحفلات والمناسبات السعيدة، فله ميزات خاصة مكلفة، ويجب
أن نحافظ على هذه الميزات.
 * لماذا يحتكر الرجل مهنة التصميم للمرأة؟
 ـ في العالم توجد مصممات كثيرات نجحن في التصميم للمرأة، ولكن في العالم العربي
يندر ذلك لظروف اجتماعية مختلفة، أيضا المرأة لو صممت تصميما جيدا بفطرتها ستقول
هذا التصميم لي، ليس في الأمر احتكار، بالعكس نحن لا نرفض الفكرة فالمرأة قادرة
على الأبداع، والرجولة لا تحتكر تصميم الأزياء.
 * صممت أحدى الشركات اليابانية روبوت خاصاً لعرض الأزياء، فهل تنجح هذه الفكرة؟.
 ـ الموديل يجب أن تعرضه امرأة، ولا أتصور أن يتم بخلاف ذلك، فلا يمكن أن أعرض
تصميماتي على روبوت، هذه تكنولوجيا ولا أتصور تطبيقها في الهوت كوتيور، هناك
محاولات تمت من هذا القبيل، مثال عرض سينمائي أقيم في التسعينيات نفذه مصمم فرنسي
اسمه هيري موجلير، ونجح العرض ولكن كان مكلفا، فقد كلف مليون دولار، وكانت محاولة
في فترة تحول للعروض السينمائية، وهناك محاولات أخرى سابقة تمت، ولكنها كانت
بمثابة رسائل وتنبيه ألى أن الأنسان تحول ألى روبوت، وأننا ذاهبون ألى الميكنة،
ولكن لا يمكن أن نستعيض عن المرأة أو الرجل بروبوت.
 * كيف تأتي فكرة التصميم؟
 ـ أحيانا يكون كالألهام فقد يأتي فجأة، وقد يكون نتيجة بحث، بعد أن تضع نفسك في
جو معين من الموسيقي والسينما والنحت والرسم، فهو أنتاج فني متكامل، تظهر معه
أشياء من الجو الذي تعيش فيه، أو تحب أن تكون فيه، أنها حالة كالحلم، ترسم موديل
ثم تنفذه أو تنفذه مباشرة، وذلك حسب الفكرة وكيفية تطورها.
 * ما رأيك ببعض المصممين الذين تمردوا على السمات الأساسية لفستان الزفاف اللون
الأبيض؟ 
ـ تطوير فستان الفرح ممكن، ولكن اللون الأبيض أساسي، فلا يمكن أن نصممه أسود أو
أحمر، يمكن أن يكون لونه رمادياً فاتحاً أو أبيض أو ذهبياً، ولكن عدا ذلك لا
أعتقد، ومن الصعب وجود مصمم يتخطى هذه الحدود، وأذا وجدت هذه الألوان في العروض
فأن 99% من العرائس لا يرتدونه، ولكن هذا لا يمنع أن يكون جميلا.
 * ما دور الأكسسوارات في تصاميمك؟
 ـ ركزت على الأكسسوارات في بعض موديلات هذه المجموعة، وفي المجموعة السابقة قدمت
فساتين مصنوعة من الأكسسوار، ولكن بطريقتي الخاصة، وكانت مستوحاة من الجو الماسي،
وأنا أفضل مجوهرات الكريستال، وأن يكون اللوك العام للأكسسوارات مجوهرات.
 * كيف يمكن الارتقاء بمهنة التصميم؟
 ـ على الدول العربية تشجيع المهنة لكي نتطور ونصل ألى المستوى العالمي، كل دور
الأزياء مرتبطة لدينا بأشخاص، في الخارج دور الأزياء كيانات كبيرة، المصمم ليس
صاحبها، وتوجد فيها هيكلية في الأدارة، وهذا قليل في العالم العربي، وأذا وجد
لدينا سيساعد المصمم كثيرا على التصميم، بعيدا عن التسويق والأدارة، ولم نصل بعد
ألى هذه المرحلة.
 في الوطن العربي هناك معدل أنفاق عال على الأزياء، ولكن لا يوجد تطور، ومهنة
الهوت كوتيور صناعة آخذة في التراجع، وفي أوروبا أصبحوا يستخدمونها في الأعلام
وفي تسويق أسمائهم، لا يهمهم أن يبيعوا، ومن خلالها يتم تسويق مواد أخرى تحت هذا
الاسم، فهم ينفقون ملايين الدولارات على العروض، ولكن تحت أطار تسويقي وأعلامي،
وعندنا يتهم المصممون العرب بأن ليس لديهم أبداع، أما أن تبدع أو تبيع."""

words = word_tokenize(str(data))
new_text = ""
for w in words:
    if w== 'إن' or w == 'أن'or w == 'لأن'or w == 'بأن'or w == 'ان'or w == 'فأن' or w == 'فإن':
        new_text = new_text 
    else :
        new_text = new_text + " " + w


# In[10]:


print (new_text)


# In[6]:


get_ipython().system('pip install transformers==4.7.0 ')
get_ipython().system('pip install nltk==3.5 ')
get_ipython().system('pip install protobuf==3.15.3 ')
get_ipython().system('pip install sentencepiece==0.1.96')


# In[11]:


from transformers import AutoTokenizer, AutoModelWithLMHead
import torch
import nltk
nltk.download('punkt')
from nltk.tokenize import sent_tokenize

device = torch.device("cuda:0" if torch.cuda.is_available() else "cpu")
m_name = "marefa-nlp/summarization-arabic-english-news"

tokenizer = AutoTokenizer.from_pretrained(m_name)
model = AutoModelWithLMHead.from_pretrained(m_name).to(device)

def get_summary(text, tokenizer, model, device="cpu", num_beams=2):
    if len(text.strip()) < 50:
        return ["Please provide more longer text"]
    
    text = "summarize: <paragraph> " + " <paragraph> ".join([ s.strip() for s in sent_tokenize(text) if s.strip() != ""]) + " </s>"
    text = text.strip().replace("\n","")
    
    tokenized_text = tokenizer.encode(text, return_tensors="pt").to(device)
    
    summary_ids = model.generate(
            tokenized_text,
            max_length=265,
            num_beams=num_beams,
            repetition_penalty=1.5, 
            length_penalty=1.0, 
            early_stopping=True
    )
    
    output = tokenizer.decode(summary_ids[0], skip_special_tokens=True)
    return [ s.strip() for s in output.split("<hl>") if s.strip() != "" ]
    
## Prepare Samples



## Get summaries

print("Original Article:", samples[0])
print("\n===========\nSummary: \n")
hls = get_summary( new_text, tokenizer, model, device)
for hl in hls:
    print("\t-", hl)
    
    


# In[ ]:




